app/views/books/new.html.erb

<%= f.label :category %><br />
<%= f.select :title, catergory_id, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'}, class: 'form-control' %></br /><br />
---
SELECT "categories".* FROM "categories"

<%= f.label :Author %><br />
<%= f.select :title, catergory_id, Author.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'}, class: 'form-control' %></br /><br />
---
SELECT "authors".* FROM "authors"

<%= f.label :Publisher %><br />
<%= f.select :title, catergory_id, Publisher.all.collect {|x| [x.name, x.id]}, {:include_blank => 'Select One'}, class: 'form-control' %></br /><br />
---
SELECT "publishers".* FROM "publishers"