app/views/books/show.html.erb

	<li><strong>Category: </strong><%= @book.category.name %></li>
	<li><strong>Author: </strong><%= @book.author.first_name %> <%= @book.author.last_name %></li>
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]