app/controllers/authors_controller.rb

INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Stan"], ["last_name", "Lee"], ["created_at", "2016-03-17 00:41:54.930869"], ["updated_at", "2016-03-17 00:41:54.930869"]]
---
  def create
    @author = Author.new(author_params)
    @author.save

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "authors" SET "first_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["first_name", "Delante Lee"], ["updated_at", "2016-03-27 17:23:56.483029"], ["id", 3]]
---
def update
    @author = Author.find(params[:id])
    @author.update(author_params)

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @author = Author.find(params[:id])

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 3]]
---
  def destroy
    @author = Author.find(params[:id])
    @author.destroy