app/controllers/books_controller.rb

INSERT INTO "books" ("title", "category_id", "author_id", "publisher_id", "isbn", "price", "format", "excerpt", "pages", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)
    @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Coding With Spiderman"], ["updated_at", "2016-03-27 16:46:40.743112"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    @book.update(book_params)

SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books"
---
  def index
    @categories = Category.all
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"
---
  def show
    @book = Book.find(params[:id])
    @categories = Category.all