app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Superhero Coding Books"], ["updated_at", "2016-03-27 17:13:26.432437"], ["id", 6]]
---
  def update
    @category = Category.find(params[:id])
    @category.update(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"
---
  def show
    @category = Category.find(params[:id])
    @categories = Category.all