app/controllers/publishers_controller.rb

INSERT INTO "publishers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Gotham Penguin"], ["created_at", "2016-03-17 00:44:27.659232"], ["updated_at", "2016-03-17 00:44:27.659232"]]
---
  def create
    @publisher = Publisher.new(publisher_params)
    @publisher.save

SELECT  "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "publishers" SET "name" = ?, "updated_at" = ? WHERE "publishers"."id" = ?  [["name", "Testing Publisher again"], ["updated_at", "2016-03-27 17:33:09.880618"], ["id", 2]]
---
  def update
    @publisher = Publisher.find(params[:id])
    @publisher.update(publisher_params)

SELECT  "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @publisher = Publisher.find(params[:id])

SELECT  "publishers".* FROM "publishers" WHERE "publishers"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "publishers" WHERE "publishers"."id" = ?  [["id", 2]]
---
  def destroy
    @publisher = Publisher.find(params[:id])
    @publisher.destroy

SELECT "publishers".* FROM "publishers"
---
  def index
    @publisher = Publisher.all